Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_4 (InputLayer)            (None, None, None, 3 0
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, None, None, 1 432         input_4[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, None, 1 64          conv2d_14[0][0]
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, None, None, 1 0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, None, None, 1 0           leaky_re_lu_12[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, None, None, 3 4608        max_pooling2d_7[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, None, 3 128         conv2d_15[0][0]
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, None, None, 3 0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, None, None, 3 0           leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, None, None, 6 18432       max_pooling2d_8[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, None, 6 256         conv2d_16[0][0]
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, None, None, 6 0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, None, None, 6 0           leaky_re_lu_14[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, None, None, 1 73728       max_pooling2d_9[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, None, 1 512         conv2d_17[0][0]
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, None, None, 1 0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, None, None, 1 0           leaky_re_lu_15[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, None, None, 2 294912      max_pooling2d_10[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, None, 2 1024        conv2d_18[0][0]
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, None, None, 2 0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, None, None, 2 0           leaky_re_lu_16[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, None, None, 5 1179648     max_pooling2d_11[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, None, 5 2048        conv2d_19[0][0]
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, None, None, 5 0           batch_normalization_17[0][0]
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, None, None, 5 0           leaky_re_lu_17[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, None, None, 1 4718592     max_pooling2d_12[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, None, 1 4096        conv2d_20[0][0]
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, None, None, 1 0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, None, None, 2 262144      leaky_re_lu_18[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, None, 2 1024        conv2d_21[0][0]
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, None, None, 2 0           batch_normalization_19[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, None, None, 1 32768       leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, None, 1 512         conv2d_24[0][0]
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, None, None, 1 0           batch_normalization_21[0][0]
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, None, None, 1 0           leaky_re_lu_21[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 3 0           up_sampling2d_2[0][0]
                                                                 leaky_re_lu_16[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, None, None, 5 1179648     leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, None, None, 2 884736      concatenate_2[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, None, 5 2048        conv2d_22[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, None, 2 1024        conv2d_25[0][0]
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, None, None, 5 0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, None, None, 2 0           batch_normalization_22[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, None, None, 2 130815      leaky_re_lu_20[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, None, None, 2 65535       leaky_re_lu_22[0][0]
==================================================================================================
Total params: 8,858,734
Trainable params: 8,852,366
Non-trainable params: 6,368
__________________________________________________________________________________________________